[
{ 
    "title": "Noticia",
    "image":[""],
    "description": "Este es mi propio Ai que install en la la Google colab(por eso debe ejutar por mano)",
    "githublinkrepo":"https://github.com/Sagmanua/SagmanOllamaAI",
    "githublinkwebsite":"https://sagmanua.github.io/SagmanOllamaAI/"
},
{
    "title": "Recetas y Planificador de Comidas",
    "image": [
        "foto of projects/Recetas/CRUD.png",
        "foto of projects/Recetas/index.png",
        "foto of projects/Recetas/login.png",
        "foto of projects/Recetas/planner.png",
        "foto of projects/Recetas/profile.png",
        "foto of projects/Recetas/recipe_details.png",
        "foto of projects/Recetas/update.png"
    ],
    "description": "Una aplicación web full-stack que permite a los usuarios gestionar recetas y organizar un calendario de comidas semanal. Incluye un sistema de autenticación, gestión de perfiles y una base de datos relacional para manejar ingredientes y menús programados mediante operaciones CRUD en un entorno PHP.",
    "language": ["Php", "CSS", "Mysql"],
    "githublinkrepo": "https://github.com/Sagmanua/Proyecto-Entornos-de-Desarrollo",
    "githublinkwebsite":"https://recepe-planer.great-site.net/Proyecto-Entornos-de-Desarrollo/"
    
},
{ 
    "title": "Noticia",
    "image":["foto of projects/Noticia/Noticia admin.index.png", "foto of projects/Noticia/Noticia admin.index.png"],
    "description": "The aplication directory, therefore, holds the necessary files (which are typically PHP, HTML, and possibly CSS/JS) for running the front-end and back-end logic of a simple administrative interface designed to manage data (perform CRUD operations) within a PHP environment.",
    "language":["Php","HTML", "CSS"],
    "githublinkrepo":"https://github.com/Sagmanua/Programacion-de-DAM-2025-2026-/tree/main/Explication/PHP%20Ud-10%20Programaci%C3%B3n%20en%20el%20lado%20del%20servidor/009%20Instalacion%20de%20CRUD/003%20Panel%20de%20control/aplication"

},
{
    "title": "Reloj Analógico Multi-Zona con Canvas",
    "image": "foto of projects/AnalogClock.png",
    "description": "Un reloj analógico interactivo desarrollado con HTML Canvas. Permite al usuario seleccionar entre la hora local, UTC y 12 zonas horarias globales principales. Utiliza la API `Intl.DateTimeFormat` de JavaScript para garantizar la precisión de la hora, incluyendo los ajustes automáticos por Horario de Verano (DST).",
    "language": ["HTML", "CSS", "JavaScript"],
    "githublinkrepo": "https://github.com/Sagmanua/Reloj-de-tiempo-",
    "githublinkwebsite":"https://sagmanua.github.io/Reloj-de-tiempo-/"
},


{ 
    "title": "Wot Wordle",
    "image": "foto of projects/Wot-wordle.png", 
    "description": "Mini-juego de adivinanza de tanques en Python: aplicación GUI creada con Tkinter que reta al usuario a adivinar un tanque elegido al azar de un archivo JSON. Proporciona retroalimentación sobre atributos como daño, velocidad, clase y nación, cuenta los intentos y cambia el fondo al ganar. Incluye un sistema de reinicio para seleccionar un nuevo tanque y probar de nuevo.",
    "language": "Python",
    "githublinkrepo": "https://github.com/Sagmanua/Wot-Wordle"
},
{ 
    "title": "Html website Asir mini-project",
    "image": "foto of projects/ASIR.png", 
    "description": "Un miniproyecto de varias páginas en HTML y CSS que presenta reseñas personales y discusiones sobre videojuegos populares de PC, incluyendo una lista de los 5 mejores y secciones dedicadas a 'The Witcher 3', 'Cyberpunk 2077' y 'Borderlands 3'. El sitio es compatible con los idiomas inglés, español y ucraniano.",
    "language": ["HTML", "CSS", "JavaScript"],
    "githublinkrepo": "https://github.com/Sagmanua/Webasirwork-2023-",
    "githublinkwebsite": "https://sagmanua.github.io/Webasirwork-2023-/"
},
{
    "title": "(En ruso) Generador de paletas de colores",
    "image": "foto of projects/Generador_de_paletas/image.png",
    "description": "Aplicación web interactiva para la generación y gestión de paletas cromáticas. Permite crear combinaciones de colores personalizadas basadas en estilos y estados de ánimo (como 'calm', 'vibrant' o 'minimalism'), con una interfaz dinámica que ajusta el contraste del texto automáticamente para asegurar la legibilidad. Incluye funciones para la edición manual de colores mediante un selector integrado, exportación de variables a CSS y pre-configuración para integración con una base de datos mediante una arquitectura escalable. Los datos se visualizan en un contenedor flexbox responsivo con efectos de transición y sombras suaves.",
    "github": "https://github.com/Sagmanua/Ideas/tree/main/ideas/palitra",
    "githublinkwebsite": "https://sagmanua.github.io/Ideas/ideas/palitra/index.html"
},
{
    "title": "(En ruso) Generador de plantillas de correo electrónico",
    "image": "foto of projects/Generador_de_plantillas/image.png",
    "description": "Aplicación web Full Stack para la generación y gestión de plantillas de correos electrónicos. Permite la creación de borradores personalizados mediante un sistema de categorías (negocios, amigos, felicitaciones) con campos de entrada dinámicos que adaptan sus etiquetas según el contexto seleccionado. Incluye un sistema completo de autenticación de usuarios y persistencia de datos en el servidor mediante una API REST construida con Node.js y Express, utilizando un archivo JSON como base de datos. El programa permite a los usuarios registrados guardar sus borradores, visualizar un historial de correos guardados con marcas de tiempo y exportar el contenido mediante la copia al portapapeles o una función de impresión optimizada.",
    "github": "https://github.com/Sagmanua/Ideas/tree/main/ideas/pisama",
    "githublinkwebsite": "https://sagmanua.github.io/Ideas/ideas/pisama/index.html"

},
{
    "title": "Agenda de Contactos in console",
    "image": "foto of projects/MenuBetter.png",
    "description": "Aplicación de consola en Python para gestionar contactos. Permite agregar, leer, actualizar y borrar registros, con validación de email y teléfono mediante expresiones regulares. Los datos se guardan de forma persistente en un archivo binario usando pickle, y el programa carga automáticamente los contactos existentes al iniciar. Incluye un menú interactivo y confirmación antes de eliminar registros.",
    "language": "Python",
    "github": "https://github.com/Sagmanua/Programacion-de-DAM-2025-2026-/tree/main/Practica/Mejorar%20menu"
}

]
