
[



{
  "title": {
    "es": "Mini Photoshop",
    "en": "Mini Photoshop",
    "ua": "Міні-Фотошоп"
  },
  "video": "https://www.youtube.com/watch?v=5SMhWIpAcXg",
  "description": {
    "es": "En este proyecto creé un 'Mini Photoshop' basado en la web donde puedes editar imágenes aplicando filtros y ajustes, y luego guardarlas directamente en tu dispositivo.",
    "en": "A web-based image editor that allows users to upload, manipulate, and apply various filters to images before saving the final result to their device.",
    "ua": "У цьому проєкті я створив веб-редактор зображень, де ви можете редагувати фотографії, застосовувати фільтри та зберігати результат на свій пристрій."
  },
  "long_description": {
    "es": "Este proyecto nació de mi curiosidad por entender cómo funcionan realmente los editores de fotos por dentro. En lugar de usar librerías externas, decidí construirlo todo desde cero usando el Canvas de HTML5 y JavaScript puro.\n\nLo que puedes hacer con él:\n- Dibujar libremente, borrar errores o añadir formas como rectángulos y círculos.\n- Subir tus propias fotos y aplicarles filtros que programé manualmente (puedes convertirlas a blanco y negro, invertir los colores o subir el brillo).\n- Un sistema de 'Deshacer' y 'Rehacer' para que no tengas miedo de experimentar.\n\nFue un gran reto manejar la manipulación de píxeles en tiempo real y asegurar que las herramientas de dibujo se sintieran fluidas. Al final, logré una herramienta sencilla pero potente que puedes usar directamente en tu navegador.",
    "en": "This project started because I wanted to see how photo editors actually work under the hood. Instead of reaching for a library, I decided to build everything from scratch using HTML5 Canvas and vanilla JavaScript.\n\nWhat you can do with it:\n- Draw freely, erase mistakes, or drop in shapes like rectangles and circles.\n- Upload your own photos and apply custom filters I coded—like turning things grayscale, inverting colors, or boosting the brightness.\n- There's a full Undo/Redo system, so you can experiment without worrying about making a mistake.\n\nThe hardest part was getting the pixel manipulation to work smoothly and making sure the drawing tools felt natural. It’s a simple but capable editor that runs entirely in the browser.",
    "ua": "Цей проєкт з'явився завдяки моєму бажанню зрозуміти, як насправді працюють фоторедактори зсередини. Замість того, щоб використовувати готові бібліотеки, я вирішив створити все з нуля за допомогою HTML5 Canvas та чистого JavaScript.\n\nОсь що вміє цей редактор:\n- Ви можете малювати, стирати помилки або додавати геометричні фігури (прямокутники та кола).\n- Завантажувати власні фото та застосовувати фільтри, які я написав вручну: чорно-білий режим, інверсія кольорів або підвищення яскравості.\n- Система «Скасувати» та «Повторити» (Undo/Redo) дозволяє експериментувати без страху зіпсувати роботу.\n\nНайскладнішим було налаштувати маніпуляцію пікселями в реальному часі та зробити так, щоб інструменти малювання були плавними. У підсумку вийшов простий, але потужний інструмент, який працює прямо в браузері."
  },
  "language": ["HTML", "CSS", "JavaScript"],
  "githublinkrepo": "https://github.com/Sagmanua/List-of-usefull-fearchers/tree/main/mini-photoshop",
  "githublinkwebsite": "https://sagmanua.github.io/List-of-usefull-fearchers/mini-photoshop/index.html"
},
{
  "title": {
    "es": "Recetas y Planificador de Comidas",
    "en": "Recipes and Meal Planner",
    "ua": "Рецепти та планувальник харчування"
  },
  "image": [
    "foto of projects/Recetas/CRUD.png",
    "foto of projects/Recetas/index.png",
    "foto of projects/Recetas/login.png",
    "foto of projects/Recetas/planner.png",
    "foto of projects/Recetas/profile.png",
    "foto of projects/Recetas/recipe_details.png",
    "foto of projects/Recetas/update.png"
  ],
  "description": {
    "es": "Una aplicación web full-stack para gestionar recetas y organizar un calendario semanal. Incluye autenticación y CRUD con PHP y MySQL.",
    "en": "A full-stack web application to manage recipes and organize a weekly calendar. Includes authentication and CRUD using PHP and MySQL.",
    "ua": "Повнофункціональний вебдодаток для керування рецептами та організації тижневого календаря. Включає автентифікацію та CRUD за допомогою PHP та MySQL."
  },
  "long_description": {
    "es": "Este proyecto representa un sistema Full-Stack completo diseñado para resolver la organización diaria de la alimentación. No se trata solo de una lista de recetas, sino de una herramienta de gestión integral donde la seguridad y la estructura de datos son fundamentales.\n\nAspectos técnicos clave:\n- Arquitectura del Servidor: Implementé un backend sólido en PHP que gestiona sesiones de usuario personalizadas, permitiendo un entorno privado para que cada usuario guarde su información.\n- Seguridad de Datos: El sistema utiliza 'Prepared Statements' para prevenir ataques de inyección SQL y funciones de hash avanzadas (password_verify/hash) para proteger las credenciales de los usuarios.\n- Lógica de Negocio (CRUD): Desarrollé un panel administrativo donde se pueden gestionar todas las recetas del sistema, permitiendo subir imágenes, editar ingredientes y organizar categorías en la base de datos MySQL.\n- Planificador Dinámico: Diseñé una base de datos relacional que vincula recetas con días específicos de la semana, creando un calendario interactivo que facilita la planificación de comidas.\n- Interfaz Intuitiva: Utilicé CSS personalizado para crear una experiencia limpia y visual, asegurando que el flujo desde el login hasta la creación de una receta sea natural para el usuario.",
    "en": "This project is a comprehensive Full-Stack system designed to streamline daily meal organization. More than just a simple recipe list, it is an end-to-end management tool where security and data structure are the main pillars.\n\nTechnical deep-dive:\n- Server Architecture: I built a robust PHP backend that manages custom user sessions, ensuring a private environment for each user to securely store their data.\n- Security First: The application implements Prepared Statements to prevent SQL injection and utilizes industry-standard hashing functions (password_verify/hash) to protect sensitive user credentials.\n- Business Logic (CRUD): I developed a full administrative panel to manage the recipe database, enabling image uploads, ingredient editing, and category organization within MySQL.\n- Dynamic Planning Logic: I designed a relational database schema that links recipes to specific weekdays, resulting in an interactive meal planner that updates in real-time.\n- User-Centric Design: Beyond the code, I focused on a clean UI using custom CSS to ensure the user journey—from initial login to detailed meal planning—is fluid and responsive.",
    "ua": "Цей проєкт — це повноцінна Full-Stack система, розроблена для вирішення щоденних завдань з організації харчування. Це не просто список рецептів, а комплексний інструмент управління, де безпека та структура даних є пріоритетами.\n\nТехнічні особливості:\n- Архітектура сервера: Я розробив надійний бекенд на PHP, який керує сесіями користувачів, забезпечуючи приватне та безпечне середовище для зберігання персональних даних.\n- Безпека даних: Система використовує підготовлені запити (Prepared Statements) для захисту від SQL-ін'єкцій та сучасні алгоритми хешування (password_verify/hash) для захисту паролів.\n- Бізнес-логіка (CRUD): Створено адміністративну панель для повного керування базою рецептів, включаючи завантаження зображень, редагування інгредієнтів та організацію категорій у MySQL.\n- Динамічне планування: Я спроектував реляційну базу даних, яка пов’язує рецепти з конкретними днями тижня, створюючи інтерактивний календар для планування раціону.\n- Користувацький досвід: Завдяки кастомному CSS я створив чистий та зрозумілий інтерфейс, що забезпечує плавний перехід від авторизації до створення власного плану харчування."
  },

  "language": ["Php", "CSS", "Mysql"],
  "githublinkrepo": "https://github.com/Sagmanua/Proyecto-Entornos-de-Desarrollo",
  "githublinkwebsite": "https://recepe-planer.great-site.net/Proyecto-Entornos-de-Desarrollo/"
},
  
{
  "title": {
    "es": "Calendario Web",
    "en": "Web Calendar Project",
    "ua": "Веб-календар"
  },
  "video": "https://www.youtube.com/watch?v=43-xwKp9JVw",
  "description": {
    "es": "Este es un calendario sencillo que muestra todos los meses del año. Permite añadir títulos, aunque el proyecto no está finalizado (decidí enfocarme en un bot de Telegram más útil con la misma idea). El principal inconveniente es que, para guardar tareas, es necesario editar manualmente el archivo JSON para que aparezcan en la web.",
    "en": "A simple web calendar showing all months of the year. While you can add titles, the project is unfinished as I moved focus toward a more practical Telegram bot with similar features. Currently, saving tasks requires manual editing of the JSON file to display them on the site.",
    "ua": "Це простий календар, який показує всі місяці року. У нього можна додавати заголовки, але проект не завершений (я вирішив зосередитися на більш корисному Telegram-боті з тією ж ідеєю). Головна особливість у тому, що для збереження завдань потрібно вручну редагувати JSON-файл, щоб вони відобразилися на сайті."
  },
  "long_description": {
    "es": "Este proyecto comenzó como un experimento personal para aprender a manipular fechas y renderizar interfaces dinámicas con JavaScript puro. Mi objetivo era crear una agenda visual donde pudiera ver mis tareas mensuales de un vistazo.\n\nLo que logré con este desarrollo:\n- Programé la lógica del calendario desde cero, calculando automáticamente los días de la semana y los cambios de mes.\n- Implementé una función de carga asíncrona (Fetch API) para leer eventos directamente desde un archivo JSON externo.\n- Diseñé una interfaz limpia y minimalista con CSS para que la navegación entre meses sea fluida.\n\nAunque el proyecto se quedó en una fase inicial porque decidí trasladar la idea a un bot de Telegram (que me resultaba más práctico para recibir notificaciones), me sirvió para dominar la estructura de datos en JSON y la manipulación del DOM en tiempo real.",
    "en": "This project started as a personal experiment to learn how to manipulate dates and render dynamic interfaces using vanilla JavaScript. My goal was to create a visual agenda where I could see my monthly tasks at a glance.\n\nKey achievements in this project:\n- I coded the calendar logic from scratch, automatically calculating weekdays and month transitions.\n- I implemented an asynchronous loading feature (Fetch API) to read events directly from an external JSON file.\n- I designed a clean, minimalist UI with CSS to ensure smooth navigation between months.\n\nWhile I paused development to pivot the idea into a Telegram bot (which I found more practical for active notifications), this project was essential for mastering JSON data structures and real-time DOM manipulation.",
    "ua": "Цей проєкт починався як мій особистий експеримент із вивчення маніпуляцій з датами та створення динамічних інтерфейсів на чистому JavaScript. Я хотів створити візуальний органайзер, де можна було б зручно переглядати завдання на місяць.\n\nЩо саме я реалізував:\n- Написав логіку календаря з нуля: програма автоматично розраховує дні тижня та правильно відображає переходи між місяцями.\n- Налаштував асинхронне завантаження даних (Fetch API), щоб події зчитувалися прямо із зовнішнього файлу JSON.\n- Розробив чистий та мінімалістичний дизайн за допомогою CSS, щоб перемикання між місяцями було плавним і приємним.\n\nХоча я вирішив не доводити веб-версію до ідеалу, а натомість реалізувати цю ідею в Telegram-боті (що виявилося зручнішим для сповіщень), цей проєкт допоміг мені глибоко розібратися в роботі з об'єктами Date та маніпуляціями з DOM в реальному часі."
  },
  "language": ["HTML", "CSS", "JavaScript", "JSON"],
  "githublinkrepo": "https://github.com/Sagmanua/List-of-usefull-fearchers/tree/main/calendario",
  "githublinkwebsite": "https://sagmanua.github.io/List-of-usefull-fearchers/calendario/index.html"
},
{
  "title": {
    "es": "Ajedrez en Pygame",
    "en": "Chess on Pygame",
    "ua": "Шахи на Pygame"
  },
  "video": ["video/Chees/chees.mp4"],
  "description": {
    "es": "Este es un proyecto donde creé un juego de ajedrez sencillo en Python utilizando la librería Pygame.",
    "en": "This is a project where I created a simple chess game in Python using the Pygame library.",
    "ua": "Це проєкт, у якому я створив прості шахи на Python з використанням бібліотеки Pygame."
  },
  "long_description": {
    "es": "Este proyecto fue mi campo de entrenamiento para dominar la Programación Orientada a Objetos (POO). Quería ver si podía construir un sistema complejo como el ajedrez desde cero, manejando no solo los gráficos, sino la lógica interna que hace que todo funcione.\n\nLo que aprendí y apliqué:\n- Estructura de Clases: Diseñé clases para las piezas y el tablero, lo que me permitió mantener el código organizado y escalable.\n- Lógica de Coordenadas: Uno de los mayores retos fue traducir los clics en la pantalla (píxeles) a la notación real del ajedrez (como 'a1' o 'h8'). Creé un sistema de conversión que hizo que programar los movimientos fuera mucho más fácil.\n- Interacción con Pygame: Programé el bucle principal del juego para detectar selecciones de piezas, resaltar cuadros y actualizar el estado visual en tiempo real.\n\nFue un ejercicio excelente para entender cómo gestionar el estado de una aplicación y cómo estructurar un proyecto de Python para que sea fácil de leer y mejorar en el futuro.",
    "en": "This project was my training ground for mastering Object-Oriented Programming (OOP). I wanted to see if I could build a complex system like chess from the ground up, handling not just the visuals, but the deep logic that makes it all work.\n\nWhat I built and learned:\n- Class Architecture: I designed specific classes for pieces and the board, which allowed me to keep the code organized and scalable as the project grew.\n- Coordinate Logic: One of the biggest hurdles was translating screen clicks (pixels) into actual chess notation (like 'a1' or 'h8'). I created a conversion system that made programming movements much more intuitive.\n- Pygame Interaction: I managed the main game loop to handle piece selection, square highlighting, and real-time visual updates.\n\nIt was a great exercise in state management and taught me how to structure a Python project so that it stays readable and easy to improve down the road.",
    "ua": "Цей проєкт став моїм тренувальним майданчиком для освоєння об'єктно-орієнтованого програмування (ООП). Мені було цікаво, чи зможу я побудувати таку складну систему, як шахи, з нуля, керуючи не лише графікою, а й внутрішньою логікою.\n\nЩо я реалізував та чому навчився:\n- Архітектура класів: Я розробив класи для фігур та дошки, що дозволило тримати код організованим та масштабованим.\n- Логіка координат: Одним із найбільших викликів був переклад кліків по екрану (пікселів) у справжню шахову нотацію (наприклад, 'a1' або 'h8'). Я створив систему конвертації, яка значно спростила програмування рухів фігур.\n- Взаємодія з Pygame: Я налаштував основний ігровий цикл для обробки вибору фігур, підсвічування клітинок та візуального оновлення в реальному часі.\n\nЦе була чудова практика в управлінні станом програми, яка навчила мене структурувати проєкти на Python так, щоб вони залишалися зрозумілими та легкими для вдосконалення в майбутньому."
  },
  "language": ["Python"],
  "githublinkrepo": "https://github.com/Sagmanua/Chess-in-Py"
},

{
  "title": {
    "es": "Lista de Recursos Útiles",
    "en": "List of Useful Resources",
    "ua": "Список корисних ресурсів"
  },
  "video":"video/list/list_of_feachers.mp4",
  "description": {
    "es": "Este es un mazo simple donde puedes encontrar aplicaciones, repositorios, páginas y videos que ayudan a resolver diversos problemas. He incluido una calificación personal para resaltar las herramientas más útiles.",
    "en": "This is a curated collection of apps, repositories, websites, and videos that solve various technical challenges. It includes a rating system to help you identify the most effective and useful resources.",
    "ua": "Це проста добірка додатків, репозиторіїв, сторінок та відео, які допомагають вирішувати різноманітні завдання. Я також додав систему оцінювання, щоб ви могли бачити найкорисніші ресурси."
  },
  "long_description": {
    "es": "Como desarrollador, constantemente encuentro herramientas increíbles, pero el problema siempre es recordarlas todas. Por eso decidí crear este 'baúl de recursos', una aplicación web que funciona como mi biblioteca personal de consulta.\n\nLo que hace especial a este proyecto:\n- Gestión de Datos Dinámica: En lugar de escribir el contenido en el HTML, el sistema lee un archivo JSON externo. Esto me permite añadir nuevas herramientas en segundos sin tocar el código principal.\n- Sistema de Filtrado Inteligente: Implementé filtros por tipo (videos, repositorios, programas) y por prioridad (desde 'Vital' hasta 'Marginal'), permitiéndome encontrar la solución adecuada en el momento justo.\n- Diseño Visual Adaptable: Utilicé una estructura de tarjetas (Grid Layout) que se ajusta a cualquier pantalla, con etiquetas de colores que indican visualmente la importancia de cada recurso.\n\nEs un proyecto que uso activamente y que demuestra cómo una solución técnica sencilla puede resolver un problema real de organización de información.",
    "en": "As a developer, I'm constantly discovering amazing tools, but the challenge is always remembering them all. That’s why I built this 'resource vault'—a web app that serves as my personal reference library.\n\nTechnical highlights of the project:\n- Dynamic Data Management: Instead of hardcoding content into HTML, the system fetches an external JSON file. This allows me to add new tools in seconds without modifying the core code.\n- Smart Filtering System: I implemented filters for both resource type (videos, repos, software) and priority level (from 'Vital' to 'Marginal'), making it easy to find the right solution at the right time.\n- Responsive Visual Design: Using CSS Grid, I created a card-based layout that adapts to any screen size, with color-coded badges to visually highlight the importance of each resource.\n\nThis is a project I actively use, and it demonstrates how a clean technical approach can solve a real-world information management problem.",
    "ua": "Як розробник, я постійно знаходжу круті інструменти, але справжня проблема — вчасно про них згадати. Тому я створив цю «цифрову скриньку» — вебдодаток, який слугує моєю особистою бібліотекою корисних посилань.\n\nЧим цікавий цей проєкт з технічного боку:\n- Динамічне керування даними: Замість того, щоб прописувати все в HTML, система зчитує зовнішній файл JSON. Це дозволяє мені додавати нові ресурси за лічені секунди, не змінюючи основний код.\n- Система розумної фільтрації: Я реалізував фільтри за типом (відео, репозиторії, програми) та пріоритетністю (від 'Vital' до 'Marginal'), що допомагає миттєво знайти потрібне рішення.\n- Адаптивний візуальний дизайн: Завдяки CSS Grid я створив інтерфейс у вигляді карток, який зручно виглядає на будь-яких пристроях, а кольорові індикатори допомагають швидко оцінити важливість ресурсу.\n\nЦе проєкт, яким я користуюся особисто, і він чудово демонструє, як просте технічне рішення може навести лад у великому обсязі інформації."
  },
  "language": ["HTML", "CSS", "JavaScript", "JSON"],
  "githublinkrepo": "https://github.com/Sagmanua/List-of-usefull-fearchers",
  "githublinkwebsite": "https://sagmanua.github.io/List-of-usefull-fearchers/"
},
{
  "title": {
    "es": "Bot de Noticias de Telegram",
    "en": "Telegram News Bot",
    "ua": "Telegram-бот новин"
  },
  "video": "https://www.youtube.com/watch?v=QhAUWw5_UJY",
  "description": {
    "es": "Con este bot puedes elegir qué noticias quieres recibir. Carga los temas más importantes según tus preferencias y permite programar un horario exacto para recibir las noticias más destacadas del mundo automáticamente.",
    "en": "This bot allows you to customize your news feed by selecting topics that interest you most. It fetches top headlines based on your choices and features a scheduling system to send you the world's most important news at a specific time of your day.",
    "ua": "За допомогою цього бота ви можете обирати цікаві для вас теми новин. Він завантажує найважливіші події за обраними категоріями, а також дозволяє створити розклад, щоб отримувати головні новини світу у точно визначений час."
  },
  "long_description": {
    "es": "Este bot nació de la necesidad de filtrar el ruido informativo y recibir solo lo que realmente importa. En lugar de navegar por múltiples portales, desarrollé una solución automatizada que entrega noticias personalizadas directamente en Telegram.\n\nAspectos técnicos destacados:\n- Integración de Noticias en Tiempo Real: Utilicé la librería `feedparser` para conectar con RSS de Google News, permitiendo buscar temas específicos o categorías globales como tecnología y ciencia.\n- Sistema de Programación (Scheduling): Implementé una lógica de horarios usando la librería `schedule`, para que el usuario pueda configurar exactamente a qué hora desea recibir su resumen diario.\n- Arquitectura Multihilo: Para que el bot pueda responder mensajes y, al mismo tiempo, controlar los horarios de envío sin bloquearse, utilicé `threading` para manejar los procesos en segundo plano.\n- Personalización de Usuario: El bot distingue entre temas oficiales y búsquedas personalizadas, adaptando la fuente de datos dinámicamente según la consulta del usuario.",
    "en": "I built this bot to solve the problem of information overload, ensuring I only receive news that truly matters. Instead of browsing multiple sites, I developed an automated solution that delivers personalized updates directly to Telegram.\n\nTechnical deep-dive:\n- Real-Time News Integration: I used the `feedparser` library to connect with Google News RSS feeds, enabling users to search for specific topics or follow global categories like tech and science.\n- Advanced Scheduling: I implemented a scheduling system using the `schedule` library, allowing users to set an exact time for their daily news summary.\n- Multi-threaded Architecture: To ensure the bot remains responsive while simultaneously tracking schedules in the background, I utilized Python's `threading` module.\n- Dynamic Query Logic: The bot intelligently distinguishes between official news categories and custom keyword searches, adapting the data source dynamically based on user input.",
    "ua": "Цей бот виник із бажання відфільтрувати інформаційний шум і отримувати лише те, що дійсно важливо. Замість того, щоб переглядати десятки сайтів, я розробив автоматизоване рішення, яке доставляє персоналізовані новини прямо в Telegram.\n\nТехнічні особливості проєкту:\n- Інтеграція новин у реальному часі: Я використав бібліотеку `feedparser` для роботи з RSS-потоками Google News, що дозволяє шукати конкретні теми або стежити за категоріями, як-от технології чи наука.\n- Система розкладу (Scheduling): Реалізував можливість планування розсилок за допомогою бібліотеки `schedule`. Користувач може сам обрати зручний час для отримання щоденного дайджесту.\n- Багатопотокова архітектура: Щоб бот міг одночасно відповідати на запити та відстежувати час відправки новин у фоновому режимі, я застосував модуль `threading`.\n- Гнучкість запитів: Бот вміє розрізняти офіційні категорії новин та індивідуальні пошукові запити, динамічно підлаштовуючи джерело даних під потреби користувача."
  },
  "language": [
    "Python",
    "Telegram_bot"
  ],
  "githublinkrepo": "https://github.com/Sagmanua/Telgram-bot/News"
},
{
  "title": {
    "es": "Bot de Telegram del Clima",
    "en": "Telegram Weather Bot",
    "ua": "Telegram-бот для погоди"
  },
  "video": "https://www.youtube.com/watch?v=xL5q0bNO1fw",
  "description": {
    "es": "Este bot te permite consultar el clima actual o programar mensajes en un horario específico para saber si lloverá o cómo estará el día. También puedes consultar el pronóstico para la semana. El bot es multilingüe y soporta inglés, ucraniano, español, francés, ruso, portugués y alemán.",
    "en": "This bot allows you to check the current weather or schedule messages at a specific time to know the daily forecast and if it will rain. You can also check the weather forecast for the entire week. The bot is multilingual, supporting EN, UA, ES, FR, RU, PT, and DE.",
    "ua": "Цей бот дозволяє перевіряти погоду на сьогодні або налаштувати сповіщення на певний час, щоб знати, чи буде дощ. Також можна переглянути прогноз на тиждень. Бот багатомовний і підтримує англійську, українську, іспанську, французьку, російську, португальську та німецьку мови."
  },
  "long_description": {
    "es": "Este proyecto es una herramienta de asistencia climática diseñada para ser global y automatizada. No solo responde a consultas al instante, sino que gestiona una base de datos para recordar las preferencias de cada usuario.\n\nAspectos técnicos clave:\n- Persistencia con SQLite: Implementé una base de datos SQL para almacenar las ciudades favoritas, los horarios de notificación y el idioma preferido de cada usuario, asegurando que el bot sea personalizado.\n- Internacionalización (i18n): Diseñé un sistema de traducciones dinámicas que soporta 7 idiomas, permitiendo que el bot sea accesible para usuarios de todo el mundo.\n- Análisis de Datos Meteorológicos: El bot procesa datos complejos de APIs externas para ofrecer no solo la temperatura, sino un análisis de probabilidad de lluvia y un desglose del pronóstico semanal (mañana, día, tarde y noche).\n- Automatización Multihilo: Utilicé hilos (threading) para que el bot pueda verificar la base de datos cada minuto y enviar alertas programadas sin interrumpir las interacciones de otros usuarios.",
    "en": "This project is a climate assistance tool designed to be global and automated. Beyond simple instant queries, it manages a database to track and remember individual user preferences.\n\nTechnical highlights:\n- SQLite Persistence: I implemented a SQL database to store favorite cities, notification schedules, and language preferences for each user, ensuring a personalized experience.\n- Internationalization (i18n): I designed a dynamic translation system supporting 7 languages, making the bot accessible to a global audience.\n- Weather Data Analysis: The bot processes complex data from external APIs to provide more than just temperature; it offers rain probability analysis and a detailed weekly breakdown (morning, day, evening, and night).\n- Multi-threaded Automation: I used background threading to allow the bot to check the database every minute and send scheduled alerts without interrupting real-time interactions with other users.",
    "ua": "Цей проєкт — це інструмент кліматичної допомоги, розроблений як глобальне та автоматизоване рішення. Бот не лише миттєво відповідає на запити, а й керує базою даних для збереження індивідуальних налаштувань користувачів.\n\nТехнічні переваги:\n- Робота з SQLite: Я реалізував SQL-базу даних для зберігання улюблених міст, розкладів сповіщень та мовних уподобань кожного користувача.\n- Інтернаціоналізація (i18n): Розробив систему динамічного перекладу на 7 мов, що робить бота доступним для користувачів з усього світу.\n- Аналіз метеоданих: Бот обробляє дані з зовнішніх API, надаючи не лише температуру, а й аналіз імовірності опадів та детальний прогноз на тиждень (ранок, день, вечір, ніч).\n- Багатопотокова автоматизація: Використав фонові потоки (threading), щоб бот міг щохвилини перевіряти базу даних і надсилати заплановані сповіщення, не перериваючи взаємодію з іншими користувачами."
  },
  "language": [
    "Python",
    "Telegram_bot",
    "SQLite"
  ],
  "githublinkrepo": "https://github.com/Sagmanua/Telgram-bot/Weather"
},
{
  "title": {
    "es": "Suite de Bots de Telegram",
    "en": "Telegram Bot Suite",
    "ua": "Набір Telegram-ботів"
  },
  "image": [
    "foto of projects/Telegram-bot/Todolist1.png",
    "foto of projects/Telegram-bot/Todolist2.png",
    "foto of projects/Telegram-bot/Todolist3.png",
    "foto of projects/Telegram-bot/AIbot.png"
  ],
  "description": {
    "es": "Este proyecto cuenta con 3 bots de Telegram: 2 para listas de tareas (ToDo-List) que envían mensajes 1 día antes de la tarea y 1 que conecta una IA. Todos funcionan, pero están alojados en servicios gratuitos; si quieres probarlos, escríbeme para que los active (@Sagmanua).",
    "en": "This project features 3 Telegram bots: 2 ToDo-Lists that send messages 1 day before the task and 1 AI-integrated bot. All are functional, but since they are hosted on free services, please message me (@Sagmanua) to turn them on if you wish to test them.",
    "ua": "Цей проєкт включає 3 Telegram-боти: 2 для списків справ (ToDo-List), які відправляють повідомлення за 1 день до терміну задачі, та 1 бот із інтеграцією штучного інтелекту. Усі вони працюють, але розміщені на безкоштовних хостингах. Якщо хочете протестувати їх, напишіть мені (@Sagmanua), щоб я їх увімкнув."
  },
  "long_description": {
    "es": "Este ecosistema de bots demuestra cómo Python puede automatizar la productividad y conectar servicios inteligentes. Desarrollé tres soluciones distintas para explorar diferentes niveles de complejidad en el backend.\n\nComponentes principales:\n- Gestión de Tareas con Base de Datos: Utilicé SQLite para crear un sistema de persistencia donde los usuarios pueden añadir, completar y eliminar tareas. Implementé un hilo (threading) dedicado que escanea la base de datos constantemente para enviar recordatorios automáticos 24 horas antes del vencimiento.\n- Sistema de Roles (Admin/User): Creé una versión avanzada con control de acceso, donde solo los administradores definidos pueden gestionar o eliminar tareas globales, mientras que los usuarios reciben las notificaciones.\n- Integración de IA: Configuré un bot capaz de procesar lenguaje natural conectándolo a modelos de inteligencia artificial, permitiendo interacciones fluidas dentro de Telegram.\n- UX Interactiva: Implementé menús con botones (Inline Keyboards) para que marcar una tarea como completada sea tan simple como un clic, mejorando la experiencia del usuario final.",
    "en": "This bot ecosystem demonstrates how Python can automate productivity and connect intelligent services. I developed three distinct solutions to explore different levels of backend complexity.\n\nKey Components:\n- Database-Driven Task Management: I used SQLite to build a persistence system where users can add, finish, and delete tasks. I implemented a dedicated background thread that constantly scans the database to trigger automatic reminders 24 hours before a deadline.\n- Role-Based Access (Admin/User): I created an advanced version featuring access control, where only defined admins can manage or delete global tasks, while users receive the notifications.\n- AI Integration: I configured a bot capable of natural language processing by connecting it to AI models, allowing for fluid conversations directly within Telegram.\n- Interactive UX: I used Inline Keyboards so that marking a task as done is as simple as a single click, significantly improving the end-user experience.",
    "ua": "Ця екосистема ботів демонструє, як Python може автоматизувати продуктивність та підключати інтелектуальні сервіси. Я розробив три різні рішення, щоб дослідити різні рівні складності бекенду.\n\nОсновні компоненти:\n- Управління завданнями через БД: Я використав SQLite для створення системи збереження даних, де користувачі можуть додавати, виконувати та видаляти завдання. Реалізовано фоновий потік (threading), який постійно сканує базу даних для відправки автоматичних нагадувань за 24 години до дедлайну.\n- Система ролей (Адмін/Користувач): Створено розширену версію з контролем доступу, де лише визначені адміністратори можуть керувати глобальними завданнями, а користувачі отримують сповіщення.\n- Інтеграція ШІ: Налаштовано бота, здатного обробляти природну мову через підключення до моделей штучного інтелекту, що дозволяє вести живий діалог прямо в Telegram.\n- Інтерактивний UX: Використано Inline-кнопки, щоб позначення завдання як виконаного відбувалося одним кліком, що значно покращує досвід користувача."
  },
  "language": ["Python", "Telegram_bot", "SQLite"],
  "githublinkrepo": "https://github.com/Sagmanua/Telgram-bot"
},

{
  "title": {
    "es": "Buscador satori",
    "en": "",
    "ua": ""
  },
  "video": "https://www.youtube.com/watch?v=ObzFmz-c4Cs",
  "description": {
    "es": "",
    "en": "This is simply search system work like chorome.",
    "ua": ""
  },
    "long_description": {
    "es": "",
    "en": "",
    "ua": ""
  },
  "language": [
    "",
    ""
  ],
  "githublinkrepo": "",
  "githublinkwebsite": ""
}
,

{
  "title": {
    "es": "Generador de Paletas de Colores",
    "en": "Color Palette Generator",
    "ua": "Генератор палітри кольорів"
  },
  "video": "vhttps://www.youtube.com/watch?v=8upxj84JILY",
  "description": {
    "es": "Generador interactivo de colores basado en estados de ánimo. Exporta variables a CSS y ajusta contraste automáticamente.",
    "en": "Interactive color generator based on moods. Exports variables to CSS and adjusts contrast automatically.",
    "ua": "Інтерактивний генератор кольорів на основі настрою. Експортує змінні в CSS та автоматично налаштовує контраст."
  },
  "long_description": {
    "es": "Este proyecto es una herramienta avanzada para diseñadores y desarrolladores que permite crear esquemas de color coherentes basados en 'moods' o estilos predefinidos. No es solo un selector de colores, sino un motor de diseño que gestiona la accesibilidad y la exportación de datos.\n\nAspectos técnicos clave:\n- Lógica de Accesibilidad: Implementé un algoritmo para calcular la luminancia de los colores, ajustando automáticamente el color del texto (blanco o negro) sobre cada muestra para garantizar la legibilidad (contraste).\n- Gestión de Datos: Utiliza un archivo JSON externo con más de 20 categorías de estilos (Cyberpunk, Nordic, Minimalist, etc.), permitiendo una expansión infinita de la base de datos.\n- Exportación Inteligente: Permite copiar la paleta directamente como variables de CSS (:root) o descargar un archivo JSON con los metadatos de la sesión.\n- Internacionalización (i18n): El sistema soporta dinámicamente tres idiomas (RU, EN, ES), cambiando toda la interfaz sin recargar la página.",
    "en": "This project is an advanced tool for designers and developers to create coherent color schemes based on 'moods' or predefined styles. It's not just a color picker, but a design engine that manages accessibility and data export.\n\nKey technical highlights:\n- Accessibility Logic: I implemented an algorithm to calculate color luminance, automatically adjusting text color (black or white) over each swatch to ensure readability and contrast.\n- Data Management: Uses an external JSON file with over 20 style categories (Cyberpunk, Nordic, Minimalist, etc.), allowing for seamless database expansion.\n- Smart Export: Users can copy the palette directly as CSS variables (:root) or download a JSON file containing session metadata.\n- Internationalization (i18n): The system dynamically supports three languages (RU, EN, ES), updating the entire UI without a page reload.",
    "ua": "Цей проект — це просунутий інструмент для дизайнерів та розробників, який дозволяє створювати гармонійні колірні схеми на основі «настроїв» або пресетів. Це не просто вибір кольору, а повноцінний двигун дизайну, що враховує доступність та експорт даних.\n\nТехнічні особливості:\n- Логіка доступності: Я реалізував алгоритм розрахунку яскравості (luminance), який автоматично змінює колір тексту (чорний або білий) на кожній картці для забезпечення ідеального контрасту та читабельності.\n- Робота з даними: Використовується зовнішній JSON-файл із понад 20 категоріями стилів (Cyberpunk, Nordic, Minimalist тощо), що дозволяє легко розширювати базу палітр.\n- Розумний експорт: Реалізовано функцію копіювання палітри у форматі CSS-змінних (:root) для миттєвої інтеграції в код, а також експорт у JSON-файл.\n- Інтернаціоналізація (i18n): Система динамічно підтримує три мови (UA, EN, ES), змінюючи інтерфейс «на льоту» без перезавантаження сторінки."
  },
  "language": ["HTML", "CSS", "JavaScript"],
  "githublinkrepo": "https://github.com/Sagmanua/Ideas/tree/main/ideas/palitra",
  "githublinkwebsite": "https://sagmanua.github.io/Ideas/ideas/palitra/index.html"
},
{
  "title": {
    "es": "Mi IA en Google Colab (Ollama)",
    "en": "My AI on Google Colab (Ollama)",
    "ua": "Мій ШІ в Google Colab (Ollama)"
  },
  "video": ["https://www.youtube.com/watch?v=WtOXou2E41g"],
  "description": {
    "es": "Este es mi propio AI instalado en Google Colab (por eso debe ejecutarse manualmente).",
    "en": "This is my own AI installed on Google Colab (therefore it must be run manually).",
    "ua": "Це мій власний ШІ, встановлений у Google Colab (тому його потрібно запускати вручну)."
  },
  "long_description": {
    "es": "Este proyecto representa una solución creativa para ejecutar Modelos de Lenguaje Grandes (LLM) de forma gratuita utilizando la potencia de Google Colab. Configuré un entorno que permite ejecutar Ollama en la nube y acceder a él desde cualquier lugar a través de una interfaz web personalizada.\n\nLogros técnicos:\n- Infraestructura en la Nube: Utilicé Google Colab para aprovechar sus recursos de GPU, permitiendo que la IA responda con rapidez.\n- Túneles de Conexión: Implementé métodos de acceso seguro (Ngrok y Cloudflared) para conectar el servidor de Ollama con la web.\n- Frontend con Streaming: Desarrollé una interfaz en JavaScript que permite ver la respuesta de la IA en tiempo real, palabra por palabra.\n\n¡Pruébalo tú mismo! He diseñado el repositorio para que sea extremadamente práctico; solo tienes que abrir mi repo y seguir las instrucciones de configuración. Es un proceso sencillo y rápido que te permitirá tener tu propia IA funcionando en minutos.",
    "en": "This project is a creative solution for running Large Language Models (LLMs) for free by leveraging Google Colab. I configured an environment that runs Ollama in the cloud, accessible through a custom-built web interface.\n\nTechnical Highlights:\n- Cloud Infrastructure: Utilized Google Colab to harness GPU acceleration for fast response times.\n- Secure Tunneling: Implemented Ngrok and Cloudflared to bridge the Ollama server to the public web.\n- Streaming Frontend: Developed a JavaScript interface that supports real-time streaming responses, showing text generation word-by-word.\n\nTry it yourself! I have designed this project to be highly practical. If you want to test it, simply open my repository and follow the setup instructions. The process is easy and straightforward, allowing you to get your own AI up and running in no time.",
    "ua": "Цей проєкт — це креативне рішення для запуску великих мовних моделей (LLM) безкоштовно, використовуючи потужності Google Colab. Я налаштував середовище, яке дозволяє запускати Ollama в хмарі та підключатися до неї через власний веб-інтерфейс.\n\nТехнічні особливості:\n- Хмарна інфраструктура: Використання Google Colab для доступу до GPU, що забезпечує швидку генерацію відповідей.\n- Тунелювання: Реалізація безпечного доступу через Ngrok та Cloudflared для зв'язку сервера з фронтендом.\n- Стрімінговий інтерфейс: Розробка JS-інтерфейсу для відображення генерації тексту в реальному часі.\n\nСпробуйте самі! Я розробив цей проєкт так, щоб він був максимально практичним. Якщо ви хочете протестувати його, просто відкрийте мій репозиторій і дотримуйтесь інструкцій. Налаштування дуже просте і швидке, що дозволить вам запустити власний ШІ за лічені хвилини."
  },
  "language": ["Python", "JavaScript", "HTML", "CSS"],
  "githublinkrepo": "https://github.com/Sagmanua/SagmanOllamaAI",
  "githublinkwebsite": "https://sagmanua.github.io/SagmanOllamaAI/"
},

{
  "title": {
    "es": "Reloj Analógico Multi-Zona",
    "en": "Multi-Zone Analog Clock",
    "ua": "Мультизонний аналоговий годинник"
  },
  "video":"https://www.youtube.com/watch?v=Caw3GpzWtlI",
  "description": {
    "es": "Reloj interactivo con HTML Canvas. Permite seleccionar entre hora local y 12 zonas globales con ajuste DST automático.",
    "en": "Interactive clock built with HTML Canvas. Allows selection between local time and 12 global zones with automatic DST adjustment.",
    "ua": "Інтерактивний годинник, створений за допомогою HTML Canvas. Дозволяє вибирати між місцевим часом та 12 глобальними зонами з автоматичним переходом на літній час."
  },
  "long_description": {
    "es": "Este proyecto nació de mi curiosidad por unir las matemáticas con el dibujo en tiempo real. En lugar de usar imágenes de fondo, decidí renderizar todo el reloj dinámicamente usando código.\n\nLo que aprendí y apliqué:\n- Matemáticas en el código: Usé trigonometría (Seno y Coseno) para mapear el tiempo a coordenadas en el lienzo, logrando que las manecillas se muevan con precisión milimétrica en un círculo de 360 grados.\n- Gestión inteligente del tiempo: Integré la API 'Intl' de JavaScript para que el reloj no solo cambie la hora, sino que entienda los cambios de horario de verano (DST) de cada ciudad automáticamente.\n- Rendimiento fluido: Implementé un bucle de animación que mantiene el segundero sincronizado perfectamente con el reloj del sistema sin consumir recursos excesivos.\n- Limpieza visual: Me enfoqué en un diseño adaptable que se ve nítido y se ajusta a cualquier tamaño de pantalla mediante CSS fluido.",
    "en": "I built this project to explore how math translates into real-time visuals. Instead of relying on static assets, I wanted the entire clock face and its movement to be generated purely through code.\n\nKey takeaways from the build:\n- Math-Driven UI: I used trigonometry (Sine and Cosine) to translate time into canvas coordinates, ensuring the clock hands rotate with perfect precision within a 360-degree space.\n- Smart Timezones: I leveraged the native JavaScript 'Intl' API to handle global time. This means the clock automatically accounts for tricky Daylight Saving Time (DST) changes in different cities without any manual updates.\n- Smooth Performance: The logic runs on a constant refresh loop, keeping the second hand perfectly in sync with the system clock for a fluid, real-time feel.\n- Responsive Canvas: I made sure the clock stays crisp and centered on any device, using CSS to maintain the drawing's aspect ratio across desktop and mobile.",
    "ua": "Цей проєкт народився з мого бажання поєднати математику та малювання в реальному часі. Замість використання готових картинок, я вирішив генерувати весь циферблат і рух стрілок виключно за допомогою коду.\n\nГоловні особливості:\n- Математика в коді: Я використав тригонометрію (синус і косинус) для перетворення часу в координати на полотні, завдяки чому стрілки рухаються з ідеальною точністю.\n- Розумні часові пояси: Я впровадив JavaScript API 'Intl' для роботи зі світовим часом. Це дозволяє годиннику автоматично враховувати перехід на літній час (DST) у різних містах без жодних ручних налаштувань.\n- Плавність роботи: Логіка базується на постійному циклі оновлення, що синхронізує секундну стрілку з системним часом для створення ефекту живого руху.\n- Адаптивність: Завдяки продуманому CSS, годинник залишається чітким і центрованим на будь-якому екрані, від монітора до смартфона."
  },
  "language": ["HTML", "CSS", "JavaScript"],
  "githublinkrepo": "https://github.com/Sagmanua/Reloj-de-tiempo-",
  "githublinkwebsite": "https://sagmanua.github.io/Reloj-de-tiempo-/"
},
{
  "title": {
    "es": "Wot Wordle",
    "en": "Wot Wordle",
    "ua": "Wot Wordle"
  },
  "video":"video/wot-wordle/wot_wordle.mp4",
  "description": {
    "es": "Mini-juego de adivinanza de tanques en Python (Tkinter). Utiliza un archivo JSON para datos de tanques y atributos.",
    "en": "Tank guessing mini-game in Python (Tkinter). Uses a JSON file for tank data and attributes.",
    "ua": "Міні-гра на вгадування танків на Python (Tkinter). Використовує JSON-файл для даних про танки та їхні характеристики."
  },
  "long_description": {
    "es": "Como fan de World of Tanks, decidí crear este juego de adivinanzas aplicando lógica de programación en Python. Es un reto técnico que va más allá de un simple cuestionario, ya que implementa mecánicas de comparación de atributos en tiempo real.\n\nDetalles del desarrollo:\n- Interfaz con Tkinter: Diseñé una interfaz de escritorio funcional utilizando widgets de Tkinter, incluyendo Comboboxes dinámicos que se alimentan directamente de la base de datos.\n- Gestión de Datos JSON: Estructuré un archivo JSON con las estadísticas de los tanques (nación, daño, velocidad, nivel) para que el juego pueda escalar fácilmente añadiendo nuevos modelos.\n- Lógica de Comparación: Desarrollé un sistema que compara la elección del usuario con un tanque aleatorio, proporcionando feedback inmediato sobre qué tan cerca está la respuesta según los atributos del vehículo.\n- Manejo de Estados: Implementé un contador de intentos y un sistema de reinicio para que la experiencia de juego sea fluida y repetible.",
    "en": "As a fan of World of Tanks, I decided to build this guessing game to put my Python logic into practice. It was a fun challenge to move beyond simple text and implement real-time attribute comparison mechanics.\n\nTechnical highlights:\n- Tkinter UI: I built a functional desktop interface using Tkinter, featuring dynamic Comboboxes that pull data directly from the tank database.\n- JSON Integration: I structured a JSON backend containing specific tank stats (nation, damage, speed, tier), allowing the game to be easily updated with new vehicles.\n- Comparison Logic: I developed the core engine that compares the user's guess against a randomly selected tank, giving instant feedback on how close the attributes are.\n- Game State Management: Included a 'tries' counter and a reset system to ensure a smooth, replayable user experience.",
    "ua": "Як фанат World of Tanks, я вирішив створити цю гру на вгадування, щоб застосувати логіку програмування на Python. Це був цікавий виклик — реалізувати механіку порівняння характеристик у реальному часі.\n\nТехнічні особливості:\n- Інтерфейс Tkinter: Я розробив функціональний десктопний додаток за допомогою віджетів Tkinter, включаючи динамічні випадаючі списки (Comboboxes), що завантажуються безпосередньо з бази даних.\n- Робота з JSON: Я структурував JSON-файл зі статистикою танків (нація, шкода, швидкість, рівень), що дозволяє легко масштабувати гру, додаючи нові моделі.\n- Логіка порівняння: Розробив систему, яка порівнює вибір користувача з випадковим танком, надаючи миттєвий зворотний зв'язок щодо близькості відповіді за характеристиками.\n- Управління станом: Реалізував лічильник спроб та систему перезапуску, щоб зробити ігровий процес плавним та зручним."
  },
  "language": ["Python"],
  "githublinkrepo": "https://github.com/Sagmanua/Wot-Wordle"
},

{
  "title": {
    "es": "Generador de Plantillas de Email",
    "en": "Email Template Generator",
    "ua": "Генератор шаблонів листів"
  },
  "image": "foto of projects/Generador_de_plantillas/image.png",
  "description": {
    "es": "App Full Stack  para crear borradores de email por categorías con persistencia de datos.",
    "en": "Full Stack App  to create email drafts by categories with data persistence.",
    "ua": "Full Stack додаток  для створення чернеток електронних листів за категоріями зі збереженням даних."
  },
  "long_description": {
    "es": "Esta aplicación Full Stack fue diseñada para optimizar la comunicación profesional mediante la creación de borradores de correo electrónico predefinidos. Es una herramienta ideal para gestionar respuestas frecuentes de forma rápida y organizada.\n\nCapacidades técnicas:\n- Arquitectura Robusta: Implementé un servidor con  y Express para gestionar la lógica de negocio y la API de plantillas.\n- Categorización Dinámica: El sistema permite filtrar plantillas por categorías (trabajo, personal, soporte), facilitando la búsqueda del mensaje adecuado.\n- Persistencia de Datos: Utiliza una base de datos para almacenar y recuperar los borradores, asegurando que la información no se pierda entre sesiones.\n- Interfaz Intuitiva: Diseñé un frontend limpio donde el usuario puede previsualizar el contenido del email y copiarlo al portapapeles con un solo clic, listo para ser enviado.",
    "en": "This Full Stack application was designed to optimize professional communication by creating predefined email drafts. It is an ideal tool for managing frequent responses quickly and in an organized manner.\n\nTechnical capabilities:\n- Robust Architecture: I implemented a server using  and Express to manage business logic and the template API.\n- Dynamic Categorization: The system allows filtering templates by categories (work, personal, support), making it easy to find the right message.\n- Data Persistence: Uses a database to store and retrieve drafts, ensuring that information is not lost between sessions.\n- Intuitive Interface: I designed a clean frontend where users can preview email content and copy it to the clipboard with a single click, ready to be sent.",
    "ua": "Цей Full Stack додаток був розроблений для оптимізації професійної комунікації за допомогою створення зумовлених чернеток електронних листів. Це ідеальний інструмент для швидкого та організованого керування частими відповідями.\n\nТехнічні можливості:\n- Надійна архітектура: Я реалізував сервер на  та Express для керування бізнес-логікою та API шаблонів.\n- Динамічна категоризація: Система дозволяє фільтрувати шаблони за категоріями (робота, особисті, підтримка), що полегшує пошук потрібного повідомлення.\n- Збереження даних: Використовується база даних для зберігання та отримання чернеток, що гарантує збереження інформації між сесіями.\n- Інтуїтивно зрозумілий інтерфейс: Я розробив чистий frontend, де користувач може попередньо переглянути вміст листа та скопіювати його в буфер обміну одним кліком, готовим до відправки."
  },
  "language": ["JavaScript", "HTML", "CSS"],
  "githublinkrepo": "https://github.com/Sagmanua/Ideas/tree/main/ideas/pisama",
  "githublinkwebsite": "https://sagmanua.github.io/Ideas/ideas/pisama/index.html"
},
{
"title": {
    "es": "Juego de Supervivencia Zombie",
    "en": "Zombie Survival Game",
    "ua": "Гра на виживання проти зомбі"
  },
  "video": "https://www.youtube.com/watch?v=38mIdOBJX8A",
  "description": {
    "es": "Un minijuego desarrollado con ayuda de IA en el que debes sobrevivir a oleadas constantes de zombies. El objetivo es aguantar el mayor tiempo posible mientras la dificultad aumenta con cada horda.",
    "en": "An AI-assisted mini-game where you must survive against endless waves of zombies. Test your skills and see how long you can last as the difficulty increases with every wave.",
    "ua": "Міні-гра, розроблена за допомогою ШІ, у якій вам потрібно виживати проти хвиль зомбі. Перевірте свої сили та спробуйте протриматися якомога довше під натиском ворогів."
  },
  "language": ["HTML","CSS","JavaScript"],
  "githublinkrepo": "https://github.com/Sagmanua/List-of-usefull-fearchers/tree/main/010%20Ai",
  "githublinkwebsite": "https://sagmanua.github.io/List-of-usefull-fearchers/010%20Ai/"
},
{
  "title": {
    "es": "Agenda de Contactos (Consola)",
    "en": "Contact Agenda (Console)",
    "ua": "Книга контактів (Консоль)"
  },
  "video":"video/menu/menu.mp4",
  "description": {
    "es": "Gestor de contactos en Python con validación de Regex y almacenamiento persistente mediante pickle.",
    "en": "Python contact manager with Regex validation and persistent storage using pickle.",
    "ua": "Менеджер контактів на Python з валідацією через Regex та постійним зберіганням даних за допомогою pickle."
  },
  "language": "Python",
  "githublinkrepo": "https://github.com/Sagmanua/Programacion-de-DAM-2025-2026-/tree/main/Practica/Mejorar%20menu"
},


{
  "title": {
    "es": "Mini-proyecto Web ASIR",
    "en": "ASIR Web Mini-project",
    "ua": "Вебмініпроєкт ASIR"
  },
  "video":"video/ASIR/Asir.mp4",
  "description": {
    "es": "Sitio web de reseñas de videojuegos en HTML/CSS. Soporta múltiples idiomas y diseño responsivo.",
    "en": "Video game review website in HTML/CSS. Supports multiple languages and responsive design.",
    "ua": "Сайт для оглядів відеоігор на HTML/CSS. Підтримує кілька мов та адаптивний дизайн."
  },
  "language": ["HTML", "CSS", "JavaScript"],
  "githublinkrepo": "https://github.com/Sagmanua/Webasirwork-2023-",
  "githublinkwebsite": "https://sagmanua.github.io/Webasirwork-2023-/"
}
]