
[

{
  "title": {
    "es": "Mini Photoshop",
    "en": "Mini Photoshop",
    "ua": "Міні-Фотошоп"
  },
  "video": "video/mini-fotoshop/How_it_work.mp4",
  "description": {
    "es": "En este proyecto creé un 'Mini Photoshop' basado en la web donde puedes editar imágenes aplicando filtros y ajustes, y luego guardarlas directamente en tu dispositivo.",
    "en": "A web-based image editor that allows users to upload, manipulate, and apply various filters to images before saving the final result to their device.",
    "ua": "У цьому проєкті я створив веб-редактор зображень, де ви можете редагувати фотографії, застосовувати фільтри та зберігати результат на свій пристрій."
  },
  "language": ["HTML","CSS","JavaScript"],
  "githublinkrepo": "https://github.com/Sagmanua/List-of-usefull-fearchers/tree/main/mini-photoshop",
  "githublinkwebsite": "https://sagmanua.github.io/List-of-usefull-fearchers/mini-photoshop/index.html"
},
{
  "title": {
    "es": "Calendario Web",
    "en": "Web Calendar Project",
    "ua": "Веб-календар"
  },
  "video": "video/Web_Calendar/How_it_work.mp4",
  "description": {
    "es": "Este es un calendario sencillo que muestra todos los meses del año. Permite añadir títulos, aunque el proyecto no está finalizado (decidí enfocarme en un bot de Telegram más útil con la misma idea). El principal inconveniente es que, para guardar tareas, es necesario editar manualmente el archivo JSON para que aparezcan en la web.",
    "en": "A simple web calendar showing all months of the year. While you can add titles, the project is unfinished as I moved focus toward a more practical Telegram bot with similar features. Currently, saving tasks requires manual editing of the JSON file to display them on the site.",
    "ua": "Це простий календар, який показує всі місяці року. У нього можна додавати заголовки, але проект не завершений (я вирішив зосередитися на більш корисному Telegram-боті з тією ж ідеєю). Головна особливість у тому, що для збереження завдань потрібно вручну редагувати JSON-файл, щоб вони відобразилися на сайті."
  },
  "language": ["HTML", "CSS", "JavaScript","JSON"],
  "githublinkrepo": "https://github.com/Sagmanua/List-of-usefull-fearchers/tree/main/calendario",
  "githublinkwebsite": "https://sagmanua.github.io/List-of-usefull-fearchers/calendario/index.html"
},

{
  "title": {
    "es": "Lista de Recursos Útiles",
    "en": "List of Useful Resources",
    "ua": "Список корисних ресурсів"
  },
  "image": "foto of projects/List_of_Useful_Resources/image.png",
  "description": {
    "es": "Este es un mazo simple donde puedes encontrar aplicaciones, repositorios, páginas y videos que ayudan a resolver diversos problemas. He incluido una calificación personal para resaltar las herramientas más útiles.",
    "en": "This is a curated collection of apps, repositories, websites, and videos that solve various technical challenges. It includes a rating system to help you identify the most effective and useful resources.",
    "ua": "це проста добірка додатків, репозиторіїв, сторінок та відео, які допомагають вирішувати різноманітні завдання. Я також додав систему оцінювання, щоб ви могли бачити найкорисніші ресурси."
  },
      "language": ["HTML", "CSS", "JavaScript","JSON"],

  "githublinkrepo": "https://github.com/Sagmanua/List-of-usefull-fearchers",
  "githublinkwebsite": "https://sagmanua.github.io/List-of-usefull-fearchers/"
},
{
  "title": {
    "es": "Bot de Noticias de Telegram",
    "en": "Telegram News Bot",
    "ua": "Telegram-бот новин"
  },
  "video": "video/News_bot/work_of_bot.mp4",
  "description": {
    "es": "Con este bot puedes elegir qué noticias quieres recibir. Carga los temas más importantes según tus preferencias y permite programar un horario exacto para recibir las noticias más destacadas del mundo automáticamente.",
    "en": "This bot allows you to customize your news feed by selecting topics that interest you most. It fetches top headlines based on your choices and features a scheduling system to send you the world's most important news at a specific time of your day.",
    "ua": "За допомогою цього бота ви можете обирати цікаві для вас теми новин. Він завантажує найважливіші події за обраними категоріями, а також дозволяє створити розклад, щоб отримувати головні новини світу у точно визначений час."
  },
  "language": [
    "Python",
    "Telegram_bot"
  ],
  "githublinkrepo": "https://github.com/Sagmanua/Telgram-bot/News"
},
{
  "title": {
    "es": "Bot de Telegram del Clima",
    "en": "Telegram Weather Bot",
    "ua": "Telegram-бот для погоди"
  },
  "video": "video/Weather_tgbot/work_of_bot.mp4",
  "description": {
    "es": "Este bot te permite consultar el clima actual o programar mensajes en un horario específico para saber si lloverá o cómo estará el día. También puedes consultar el pronóstico para la semana. El bot es multilingüe y soporta inglés, ucraniano, español, francés, ruso, portugués y alemán.",
    "en": "This bot allows you to check the current weather or schedule messages at a specific time to know the daily forecast and if it will rain. You can also check the weather forecast for the entire week. The bot is multilingual, supporting EN, UA, ES, FR, RU, PT, and DE.",
    "ua": "Цей бот дозволяє перевіряти погоду на сьогодні або налаштувати сповіщення на певний час, щоб знати, чи буде дощ. Також можна переглянути прогноз на тиждень. Бот багатомовний і підтримує англійську, українську, іспанську, французьку, російську, португальську та німецьку мови."
  },
  "language": [
    "Python",
    "Telegram_bot"
  ],
  "githublinkrepo": "https://github.com/Sagmanua/Telgram-bot/Weather"
},
{
  "title": {
    "es": "Bot de Telegram",
    "en": "Telegram Bot",
    "ua": "Telegram-бот"
  },
      "image": [
      "foto of projects/Telegram-bot/Todolist1.png",
      "foto of projects/Telegram-bot/Todolist2.png",
      "foto of projects/Telegram-bot/Todolist3.png",
      "foto of projects/Telegram-bot/AIbot.png"

    ],

  "description": {
    "es": "Este proyecto cuenta con 3 bots de Telegram: 2 para listas de tareas (ToDo-List) que envió mensaje 1 día antes de tarea  y 1 que conecta una IA. Todos funcionan, pero están alojados en servicios gratuitos; si quieres probarlos, escríbeme para que los active (@Sagmanua).",
    "en": "This project features 3 Telegram bots: 2 ToDo-Lists that send mesage 1 day before task  and 1 AI-integrated bot. All are functional, but since they are hosted on free services, please message me (@Sagmanua) to turn them on if you wish to test them.",
    "ua": "Цей проєкт включає 3 Telegram-боти: 2 для списків справ (ToDo-List) який відправляее повідомленя за 1 день до термину задачі та 1 бот із інтеграцією штучного інтелекту. Усі вони працюють, але розміщені на безкоштовних хостингах. Якщо хочете протестувати їх, напишіть мені (@Sagmanua), щоб я їх увімкнув."
  },
  "language": ["Python","Telegram_bot"],
  "githublinkrepo": "https://github.com/Sagmanua/Telgram-bot"
},
{
  "title": {
    "es": "Ajedrez en Pygame",
    "en": "Chess on Pygame",
    "ua": "Шахи на Pygame"
  },
  "video": ["video/Chees/chees.mp4"],
  "description": {
    "es": "Este es un proyecto donde creé un juego de ajedrez sencillo en Python utilizando la librería Pygame.",
    "en": "This is a project where I created a simple chess game in Python using the Pygame library.",
    "ua": "Це проєкт, у якому я створив прості шахи на Python з використанням бібліотеки Pygame."
  },
  "language": ["Python"],
  "githublinkrepo": "https://github.com/Sagmanua/Chess-in-Py"
},
{
    "title": {
      "es": "Mi AI en Google Colab",
      "en": "My AI in Google Colab",
      "ua": "Мій ШІ в Google Colab"
    },
    "video": ["video/AIColab/AIcolab.mp4"],
    "description": {
      "es": "Este es mi propio AI instalado en Google Colab (por eso debe ejecutarse manualmente).",
      "en": "This is my own AI installed on Google Colab (therefore it must be run manually).",
      "ua": "Це мій власний ШІ, встановлений у Google Colab (тому його потрібно запускати вручну)."
    },
    "language": ["Python", "JavaScript"],
    "githublinkrepo": "https://github.com/Sagmanua/SagmanOllamaAI",
    "githublinkwebsite": "https://sagmanua.github.io/SagmanOllamaAI/"
  },
  {
    "title": {
      "es": "Recetas y Planificador de Comidas",
      "en": "Recipes and Meal Planner",
      "ua": "Рецепти та планувальник харчування"
    },
    "image": [
      "foto of projects/Recetas/CRUD.png",
      "foto of projects/Recetas/index.png",
      "foto of projects/Recetas/login.png",
      "foto of projects/Recetas/planner.png",
      "foto of projects/Recetas/profile.png",
      "foto of projects/Recetas/recipe_details.png",
      "foto of projects/Recetas/update.png"
    ],
    "description": {
      "es": "Una aplicación web full-stack para gestionar recetas y organizar un calendario semanal. Incluye autenticación y CRUD con PHP y MySQL.",
      "en": "A full-stack web application to manage recipes and organize a weekly calendar. Includes authentication and CRUD using PHP and MySQL.",
      "ua": "Повнофункціональний вебдодаток для керування рецептами та організації тижневого календаря. Включає автентифікацію та CRUD за допомогою PHP та MySQL."
    },
    "language": ["Php", "CSS", "Mysql"],
    "githublinkrepo": "https://github.com/Sagmanua/Proyecto-Entornos-de-Desarrollo",
    "githublinkwebsite": "https://recepe-planer.great-site.net/Proyecto-Entornos-de-Desarrollo/"
  },
  {
    "title": {
      "es": "Panel de Administración de Noticias",
      "en": "News Admin Panel",
      "ua": "Панель адміністратора новин"
    },
    "image": ["foto of projects/Noticia/Noticia admin.index.png"],
    "description": {
      "es": "Interfaz administrativa simple diseñada para gestionar datos (operaciones CRUD) dentro de un entorno PHP.",
      "en": "Simple administrative interface designed to manage data (CRUD operations) within a PHP environment.",
      "ua": "Простий адміністративний інтерфейс для керування даними (операції CRUD) у середовищі PHP."
    },
    "language": ["Php", "HTML", "CSS"],
    "githublinkrepo": "https://github.com/Sagmanua/Programacion-de-DAM-2025-2026-/tree/main/Explication/PHP%20Ud-10%20Programaci%C3%B3n%20en%20el%20lado%20del%20servidor/009%20Instalacion%20de%20CRUD/003%20Panel%20de%20control/aplication"
  },
  {
    "title": {
      "es": "Reloj Analógico Multi-Zona",
      "en": "Multi-Zone Analog Clock",
      "ua": "Мультизонний аналоговий годинник"
    },
    "image": "foto of projects/AnalogClock.png",
    "description": {
      "es": "Reloj interactivo con HTML Canvas. Permite seleccionar entre hora local y 12 zonas globales con ajuste DST automático.",
      "en": "Interactive clock built with HTML Canvas. Allows selection between local time and 12 global zones with automatic DST adjustment.",
      "ua": "Інтерактивний годинник, створений за допомогою HTML Canvas. Дозволяє вибирати між місцевим часом та 12 глобальними зонами з автоматичним переходом на літній час."
    },
    "language": ["HTML", "CSS", "JavaScript"],
    "githublinkrepo": "https://github.com/Sagmanua/Reloj-de-tiempo-",
    "githublinkwebsite": "https://sagmanua.github.io/Reloj-de-tiempo-/"
  },
  {
    "title": {
      "es": "Wot Wordle",
      "en": "Wot Wordle",
      "ua": "Wot Wordle"
    },
    "image": "foto of projects/Wot-wordle.png",
    "description": {
      "es": "Mini-juego de adivinanza de tanques en Python (Tkinter). Utiliza un archivo JSON para datos de tanques y atributos.",
      "en": "Tank guessing mini-game in Python (Tkinter). Uses a JSON file for tank data and attributes.",
      "ua": "Міні-гра на вгадування танків на Python (Tkinter). Використовує JSON-файл для даних про танки та їхні характеристики."
    },
    "language": "Python",
    "githublinkrepo": "https://github.com/Sagmanua/Wot-Wordle"
  },
  {
    "title": {
      "es": "Mini-proyecto Web ASIR",
      "en": "ASIR Web Mini-project",
      "ua": "Вебмініпроєкт ASIR"
    },
    "image": "foto of projects/ASIR.png",
    "description": {
      "es": "Sitio web de reseñas de videojuegos en HTML/CSS. Soporta múltiples idiomas y diseño responsivo.",
      "en": "Video game review website in HTML/CSS. Supports multiple languages and responsive design.",
      "ua": "Сайт для оглядів відеоігор на HTML/CSS. Підтримує кілька мов та адаптивний дизайн."
    },
    "language": ["HTML", "CSS", "JavaScript"],
    "githublinkrepo": "https://github.com/Sagmanua/Webasirwork-2023-",
    "githublinkwebsite": "https://sagmanua.github.io/Webasirwork-2023-/"
  },
  {
    "title": {
      "es": "Generador de Paletas de Colores",
      "en": "Color Palette Generator",
      "ua": "Генератор палітри кольорів"
    },
    "video": "video/Generador_de_paletas/Generator.mp4",
    "description": {
      "es": "Generador interactivo de colores basado en estados de ánimo. Exporta variables a CSS y ajusta contraste automáticamente.",
      "en": "Interactive color generator based on moods. Exports variables to CSS and adjusts contrast automatically.",
      "ua": "Інтерактивний генератор кольорів на основі настрою. Експортує змінні в CSS та автоматично налаштовує контраст."
    },
    "language": ["HTML", "CSS", "JavaScript"],
    "githublinkrepo": "https://github.com/Sagmanua/Ideas/tree/main/ideas/palitra",
    "githublinkwebsite": "https://sagmanua.github.io/Ideas/ideas/palitra/index.html"
  },
  {
    "title": {
      "es": "Generador de Plantillas de Email",
      "en": "Email Template Generator",
      "ua": "Генератор шаблонів листів"
    },
    "image": "foto of projects/Generador_de_plantillas/image.png",
    "description": {
      "es": "App Full Stack (Node.js/Express) para crear borradores de email por categorías con persistencia de datos.",
      "en": "Full Stack App (Node.js/Express) to create email drafts by categories with data persistence.",
      "ua": "Full Stack додаток (Node.js/Express) для створення чернеток електронних листів за категоріями зі збереженням даних."
    },
    "language": ["JavaScript", "HTML", "CSS"],
    "githublinkrepo": "https://github.com/Sagmanua/Ideas/tree/main/ideas/pisama",
    "githublinkwebsite": "https://sagmanua.github.io/Ideas/ideas/pisama/index.html"
  },
{
"title": {
    "es": "Juego de Supervivencia Zombie",
    "en": "Zombie Survival Game",
    "ua": "Гра на виживання проти зомбі"
  },
  "video": "video/Game_cratos/How_it_works.mp4",
  "description": {
    "es": "Un minijuego desarrollado con ayuda de IA en el que debes sobrevivir a oleadas constantes de zombies. El objetivo es aguantar el mayor tiempo posible mientras la dificultad aumenta con cada horda.",
    "en": "An AI-assisted mini-game where you must survive against endless waves of zombies. Test your skills and see how long you can last as the difficulty increases with every wave.",
    "ua": "Міні-гра, розроблена за допомогою ШІ, у якій вам потрібно виживати проти хвиль зомбі. Перевірте свої сили та спробуйте протриматися якомога довше під натиском ворогів."
  },
  "language": ["HTML","CSS","JavaScript"],
  "githublinkrepo": "https://github.com/Sagmanua/List-of-usefull-fearchers/tree/main/010%20Ai",
  "githublinkwebsite": "https://sagmanua.github.io/List-of-usefull-fearchers/010%20Ai/"
},
  {
    "title": {
      "es": "Agenda de Contactos (Consola)",
      "en": "Contact Agenda (Console)",
      "ua": "Книга контактів (Консоль)"
    },
    "image": "foto of projects/MenuBetter.png",
    "description": {
      "es": "Gestor de contactos en Python con validación de Regex y almacenamiento persistente mediante pickle.",
      "en": "Python contact manager with Regex validation and persistent storage using pickle.",
      "ua": "Менеджер контактів на Python з валідацією через Regex та постійним зберіганням даних за допомогою pickle."
    },
    "language": "Python",
    "githublinkrepo": "https://github.com/Sagmanua/Programacion-de-DAM-2025-2026-/tree/main/Practica/Mejorar%20menu"
  }
]