[
{ 
    "title": "Noticia",
    "image":"foto of projects/AnalogClock.png", 
    "description": "The aplication directory, therefore, holds the necessary files (which are typically PHP, HTML, and possibly CSS/JS) for running the front-end and back-end logic of a simple administrative interface designed to manage data (perform CRUD operations) within a PHP environment.",
    "language":["Php","HTML", "CSS"],
    "githublinkrepo":"https://github.com/Sagmanua/Programacion-de-DAM-2025-2026-/tree/main/Explication/PHP%20Ud-10%20Programaci%C3%B3n%20en%20el%20lado%20del%20servidor/009%20Instalacion%20de%20CRUD/003%20Panel%20de%20control/aplication"

},
{
    "title": "Reloj Analógico Multi-Zona con Canvas",
    "image": "foto of projects/AnalogClock.png",
    "description": "Un reloj analógico interactivo desarrollado con HTML Canvas. Permite al usuario seleccionar entre la hora local, UTC y 12 zonas horarias globales principales. Utiliza la API `Intl.DateTimeFormat` de JavaScript para garantizar la precisión de la hora, incluyendo los ajustes automáticos por Horario de Verano (DST).",
    "language": ["HTML", "CSS", "JavaScript"],
    "githublinkrepo": "https://github.com/Sagmanua/Reloj-de-tiempo-",
    "githublinkwebsite":"https://sagmanua.github.io/Reloj-de-tiempo-/"
},


{ 
    "title": "Wot Wordle",
    "image": "foto of projects/Wot-wordle.png", 
    "description": "Mini-juego de adivinanza de tanques en Python: aplicación GUI creada con Tkinter que reta al usuario a adivinar un tanque elegido al azar de un archivo JSON. Proporciona retroalimentación sobre atributos como daño, velocidad, clase y nación, cuenta los intentos y cambia el fondo al ganar. Incluye un sistema de reinicio para seleccionar un nuevo tanque y probar de nuevo.",
    "language": "Python",
    "githublinkrepo": "https://github.com/Sagmanua/Wot-Wordle"
},
{ 
    "title": "Html website Asir mini-project",
    "image": "foto of projects/ASIR.png", 
    "description": "Un miniproyecto de varias páginas en HTML y CSS que presenta reseñas personales y discusiones sobre videojuegos populares de PC, incluyendo una lista de los 5 mejores y secciones dedicadas a 'The Witcher 3', 'Cyberpunk 2077' y 'Borderlands 3'. El sitio es compatible con los idiomas inglés, español y ucraniano.",
    "language": ["HTML", "CSS", "JavaScript"],
    "githublinkrepo": "https://github.com/Sagmanua/Webasirwork-2023-",
    "githublinkwebsite": "https://sagmanua.github.io/Webasirwork-2023-/"
},
{
    "title": "Agenda de Contactos in console",
    "image": "foto of projects/MenuBetter.png",
    "description": "Aplicación de consola en Python para gestionar contactos. Permite agregar, leer, actualizar y borrar registros, con validación de email y teléfono mediante expresiones regulares. Los datos se guardan de forma persistente en un archivo binario usando pickle, y el programa carga automáticamente los contactos existentes al iniciar. Incluye un menú interactivo y confirmación antes de eliminar registros.",
    "language": "Python",
    "githublinkrepo": "https://github.com/Sagmanua/Programacion-de-DAM-2025-2026-/tree/main/Practica/Mejorar%20menu"
}

]
